<?php
$_['heading_title']  = 'Модуль секретный ключ администратора';
$_['text_extension'] = 'Расширения';
$_['text_success']   = 'Настройки успешно изменены!';
$_['text_edit']      = 'Настройки модуля';
$_['entry_status']   = 'Статус';
$_['text_enabled']   = 'Включено';
$_['text_disabled']  = 'Выключено';

$_['entry_key']   = 'Секретный ключ (только английские буквы и цифры)';
$_['entry_key_example']   = 'djegfyutGkjy9075tKGII74jy42';
$_['entry_page']   = 'Url для переадресации';

$_['brief_instructions']   = 'Для защиты URL входа в панель администратора введите свое значение в поле СЕКРЕТНЫЙ КЛЮЧ, или оставте пустым, чтобы не включать защиту.<br>
Вы можете указать свой Url для переадресации запросов без секретного ключа, или оставте поле пустым.';
$_['text_redirect_enabled'] = 'Переадресация будет на URL: ';
$_['text_redirect_disabled'] = 'Переадресация по умолчанию на URL: ';

$_['text_url_enabled']   = 'Защита включена, вот ваш секретный URL <b>(сохраните его у себя)</b>: ';
$_['text_url_disabled']   = 'Защита выключена, используйте для входа обычный URL: ';

$_['text_error']  = '<font color=red>Ошибка в конфигурации не указан HTTP_SERVER</font>';